[
  "If you could live in any fantasy world, which one would you choose?",
  "If you could have any magical creature as a companion, what would it be?",
  "If you could cast any spell from a book or movie, what would it be?",
  "If you could visit any fictional place, where would you go?",
  "If you could befriend any fictional character, who would it be?",
  "If you could live in a space colony, would you?",
  "If you could control any element (e.g., fire, water, earth, air), which would you choose?",
  "If you could live in a parallel universe where one aspect of life is different, what would that difference be?",
  "In a reality where animals can speak, what do you think they would say about humans?",
  "Imagine a world where emotions can be transferred from one person to another—how would that change relationships?",
  "What if everyone in an alternate reality had the power to read minds—how would that change human behavior?",
  "In an alternate reality where dreams can be controlled, how would you use this power?",
  "If you discovered a doorway to an alternate dimension, would you enter it without knowing what lies ahead? Why or why not?",
  "What if you discovered that one of your ancestors was a legendary figure—how would that change your perception of yourself?",
  "If every person had a guardian mythical creature—what would yours be, and how would it protect you?",
  "If you could rewrite a famous legend or myth, which one would you choose, and how would you change it?",
  "Imagine you could change one historical event—what would you alter, and what do you think the consequences would be?",
  "If you could observe one historical figure for a day, who would it be and why?",
  "If you could bring someone from the past to the present, who would it be, and what would you show them?",
  "If you could create your own fantasy world, what would it be like?",
  "Imagine living in a world where magic is real—what magical ability would you want to have?",
  "What if you were the ruler of a fantasy kingdom—what laws would you implement?",
  "If you could visit any fictional fantasy world, which one would it be and why?",
  "What if you were a character in a fantasy novel—what would your role be?",
  "If you could combine two different fantasy worlds into one, which ones would you choose?",
  "What if you could permanently live in a fantasy world but could never return to reality—would you do it?",
  "If you could have any superpower, but it could only be used once a day, what would it be and why?",
  "What if you could give one superpower to a friend or family member—what would you choose for them?",
  "If you could have a superpower but had to lose one of your five senses in exchange, would you do it? Which sense?",
  "If you could create a new superpower that doesn't exist in comics or movies, what would it be?",
  "If you could explore any planet in our solar system, which one would you choose and why?",
  "Imagine discovering an alien species—what would be your first message to them?",
  "What if you were selected to be the first human to live on Mars—would you accept the offer?",
  "If you could travel faster than light, where would you go first, and what would you hope to find?",
  "Imagine you discovered an alien artifact—what would you do with it?",
  "If you could solve one of the universe's greatest mysteries, which one would you choose and why?",
  "If you could communicate with a being from another dimension, what would you want to learn from them?",
  "What if the universe is a simulation—how would that change your perspective on life?",
  "What if you could join any fictional adventure team, who would you choose, and what would be your role?",
  "Imagine you found an ancient map leading to a hidden treasure—would you follow it? Who would you bring along?",
  "If one ordinary object in your home could possess a magical property, what would it be, and how would it change your daily life?",
  "What if, for one hour each day, you could experience the world through the eyes of someone you love—whose perspective would you choose, and why?",
  "Imagine you could capture a moment of pure joy in a bottle to relive whenever you needed—what moment would you choose?"
]
