[
  "What would you want your last meal to be?",
  "If you could eliminate one food from existence, what would it be?",
  "If you could have one superpower what would it be?",
  "If you could live in any fictional universe, which one would you choose and why?",
  "If you could have dinner with any historical figure, who would it be and why?",
  "If you could have dinner with any fictional character, who would it be and why?",
  "If you could only listen to one song for the rest of your life, what would it be?",
  "If you could only listen to one album for the rest of your life, what would it be?",
  "If you could travel back in time to any event in history, which event would you choose to witness?",
  "If you could live in any time period in history, which one would you choose and why?",
  "If you could switch places with any celebrity for a week, who would it be?",
  "If you could instantly learn any language fluently, which one would you choose and why?",
  "If you could master any musical instrument instantly, which one would you choose and why?",
  "If you could have any skill in the world without needing to practice, what skill would you choose?",
  "If you could instantly become an expert in any subject, which one would you choose?",
  "If you could be any animal for a day, which animal would you choose to be and why?",
  "If you could visit any country in the world, where would you go and what would you do there?",
  "If you could live in any city in the world, where would you choose to live and why?",
  "If you could have any type of weather all year round, what would you choose?",
  "If you could meet your future self, what question would you ask them?",
  "If you could be any age forever, what age would you choose and why?",
  "If you could have any fictional vehicle, which one would you choose and why?",
  "If you could make one book required reading for everyone, which one would it be and why?",
  "If you could see one famous person in concert (money is no object), who would it be and why?",
  "If a genie granted you one wish (no extra wishes), what would you wish for?",
  "If you had to choose a TV show to be in, which one would it be?",
  "Which actor/celebrity would you want to play you in a movie?",
  "If you could eliminate one household chore for the rest of your life, which would it be?",
  "Which way do you face when you shower? Back to the shower or facing the shower?",
  "What is one food you refuse to eat, and why?",
  "Do you wipe sitting or standing?",
  "When you wipe, do you crumple, roll, or fold the toilet paper?",
  "In what order do you put your clothing on?",
  "In what order do you wash your body in the shower?",
  "If you had to talk about 1 topic for an hour with no preparation, what would it be?",
  "What is the one show or movie that you haven't watched, but you feel like everyone else has?",
  "Where is the prettiest location you've ever travelled to?",
  "You're a burglar, but you can only steal things that mildly inconvenience your victims. What are you taking?",
  "If you could only eat one vegetable for the rest of your life, what would it be?",
  "If you could have any food, right now, what would it be?",
  "What is your favorite candy?",
  "Who would you pick to be on your Family Feud team? You get 5 people.",
  "If you had to choose one roommate from your family, who would it be and why?",
  "Who would you want to be for a day if it could be anyone?",
  "You have to sing one karaoke song, what is it?",
  "What is your preferred comfort food, and why?",
  "What is your favorite pizza, and why?",
  "What is your favorite attribute in a person?",
  "What message would you send to an alien civilization?",
  "Describe a typical Friday or Saturday night during your highschool years?",
  "If you could have any superpower, but could only use it once a month, what would it be?",
  "If there was a TV show based on your life, what would be the name of the show?",
  "What did you buy with your first work paycheck?",
  "If you were given $5,000 right now and you had to spend it in 1 hour, how would you spend it?",
  "If money was no object, what object would you collect?",
  "What is something you can't do, that most others can?",
  "If you could unlearn one piece of information, what would it be?",
  "If you could communicate with any animal species, which would you choose and why?",
  "If you could bring one extinct species back to life, which would you choose and why?",
  "What is your favorite holiday, and why?",
  "What was the silliest thing you believed as a child?",
  "Did you have an imaginary friend? What was their name?",
  "What’s the funniest prank you ever pulled on a sibling or friend?",
  "What was the most embarrassing thing your parents did in front of your friends?",
  "Did you have a favorite weird snack as a child?",
  "What’s the funniest reason you ever got in trouble at school?",
  "Did you ever try to run away from home? How far did you get?",
  "What was the most epic playground game you played as a kid?",
  "What’s the strangest childhood fear you had?",
  "What movie or show always makes you laugh no matter how many times you watch it?",
  "Who is your all-time favorite TV show character and why?",
  "What’s the most memorable movie line you can quote off the top of your head?",
  "If you could rewrite the ending of any movie, which one would it be and what would you change?",
  "What TV show did you watch religiously as a kid?",
  "What’s the worst movie that you still secretly love?",
  "If you could have a movie marathon of any genre, what would it be?",
  "What’s your guilty pleasure TV show that you’re embarrassed to admit you love?",
  "If money were no object, where would you go on vacation tomorrow?",
  "If you could live in any foreign country for a year, where would it be?",
  "What’s your idea of the perfect vacation: beach, mountains, city, or something else?",
  "What’s the strangest place you’ve ever wanted to visit?",
  "If you could go on a road trip across any country, which one would you choose?",
  "What’s the most adventurous activity you’d want to try on vacation?",
  "If you could time travel to any era for a vacation, when and where would you go?",
  "What’s the one place you think everyone should visit at least once in their life?",
  "If you could plan a group vacation anywhere, where would we all go?",
  "If you had an entire weekend to yourself, what hobby would you indulge in?",
  "What hobby have you always wanted to try but never did?",
  "What’s the most unusual hobby you’ve ever partaked in?",
  "If you could turn any hobby into a full-time career, what would it be?",
  "What’s your go-to hobby when you need to relax?",
  "What’s the weirdest collection you’ve ever had?",
  "What’s the most rewarding hobby you’ve ever had?",
  "What hobby from your childhood do you wish you still had time for?",
  "If you could have dinner with any three people, dead or alive, who would you choose?",
  "If you had a million dollars to spend in 24 hours, what would you do with it?",
  "If you were stranded on a desert island, what three items would you want with you?",
  "If you could only eat one food for the rest of your life, what would it be?",
  "If you could only eat one type of cuisine for the rest of your life, what would it be?",
  "What’s the weirdest food combination you actually enjoy?",
  "If you could have any celebrity chef cook you dinner, who would you choose?",
  "What’s your favorite meal to cook for others?",
  "What’s the most adventurous thing you’ve ever eaten?",
  "If you could create your own restaurant, what kind of food would you serve?",
  "What’s the one recipe you’ve always wanted to try but haven’t yet?",
  "What’s the best meal you’ve ever had on vacation?",
  "If you could have an endless supply of one snack, what would it be?",
  "If your pet could talk, what do you think they would say?",
  "What’s the strangest pet you’ve ever owned or wanted to own?",
  "If your pet had a job, what do you think it would be?",
  "Who was your first celebrity crush?",
  "Who is your current celebrity crush?",
  "What’s the most embarrassing celebrity crush you’ve ever had?",
  "Who’s your favorite actor that you think is underrated?",
  "What celebrity would you love to have as a best friend?",
  "If you could attend any celebrity event, which one would it be?",
  "Who’s the one celebrity you’d be most star-struck to meet?",
  "What’s your favorite celebrity couple?",
  "What’s the most embarrassing thing that’s ever happened to you in public?",
  "What’s the funniest mistake you’ve ever made?",
  "Have you ever accidentally texted the wrong person? What happened?",
  "What’s the most awkward situation you’ve ever found yourself in?",
  "What’s the most embarrassing thing you’ve done in front of a crush?",
  "What’s the weirdest thing you’ve done when you thought no one was watching?",
  "What’s the most embarrassing fashion choice you’ve ever made?",
  "If you could have dinner with a current world leader, who would it be and what would you discuss?",
  "If you could have dinner with any author, past or present, who would you choose?",
  "If you could have dinner with a deceased family member, who would it be and what would you ask them?",
  "If you could have dinner with any scientist or inventor, who would you pick and why?",
  "If you could have a meal with any athlete, who would it be and what sport would you talk about?",
  "If you could have dinner with any artist or musician, who would it be and what would you want to know about their work?",
  "Do you think aliens are real?",
  "Do you think aliens have visited Earth?",
  "What song would you want played at your funeral?",
  "What is the best meal that you have cooked?",
  "When you have a great song playing in your car, but you arrive at your destination, do you let the song finish before you get out?",
  "Do you feel the need to treat inanimate objects fairly?"
]
