[
  "What would you want your last meal to be?",
  "If you could eliminate one food from existence, what would it be?",
  "If you could have one superpower what would it be?",
  "If you could live in any fictional universe, which one would you choose and why?",
  "If you could have dinner with any historical figure, who would it be and why?",
  "If you could have dinner with any fictional character, who would it be and why?",
  "If you could only listen to one song for the rest of your life, what would it be?",
  "If you could only listen to one album for the rest of your life, what would it be?",
  "If you could travel back in time to any event in history, which event would you choose to witness?",
  "If you could live in any time period in history, which one would you choose and why?",
  "If you could switch places with any celebrity for a week, who would it be?",
  "If you could instantly learn any language fluently, which one would you choose and why?",
  "If you could master any musical instrument instantly, which one would you choose and why?",
  "If you could have any skill in the world without needing to practice, what skill would you choose?",
  "If you could instantly become an expert in any subject, which one would you choose?",
  "If you could be any animal for a day, which animal would you choose to be and why?",
  "If you could visit any country in the world, where would you go and what would you do there?",
  "If you could live in any city in the world, where would you choose to live and why?",
  "If you could have any type of weather all year round, what would you choose?",
  "If you could meet your future self, what question would you ask them?",
  "If you could be any age forever, what age would you choose and why?",
  "If you could have any fictional vehicle, which one would you choose and why?",
  "If you could make one book required reading for everyone, which one would it be and why?",
  "If you could see one famous person in concert (money is no object), who would it be and why?",
  "If a genie granted you one wish (no extra wishes), what would you wish for?",
  "If you had to choose a TV show to be in, which one would it be?",
  "Which actor/celebrity would you want to play you in a movie?",
  "If you could eliminate one household chore for the rest of your life, which would it be?",
  "Which way do you face when you shower? Back to the shower or facing the shower?",
  "What is one food you refuse to eat, and why?",
  "Do you wipe sitting or standing?",
  "When you wipe, do you crumple, roll, or fold the toilet paper?"
]
