[
  "What would you want your last meal to be?",
  "If you could eliminate one food from existence, what would it be?",
  "If you could have one superpower what would it be?",
  "If you could live in any fictional universe, which one would you choose and why?",
  "If you could have dinner with any historical figure, who would it be and why?",
  "If you could have dinner with any fictional character, who would it be and why?",
  "If you could only listen to one song for the rest of your life, what would it be?",
  "If you could only listen to one album for the rest of your life, what would it be?",
  "If you could travel back in time to any event in history, which event would you choose to witness?",
  "If you could live in any time period in history, which one would you choose and why?",
  "If you could switch places with any celebrity for a week, who would it be?",
  "If you could instantly learn any language fluently, which one would you choose and why?",
  "If you could master any musical instrument instantly, which one would you choose and why?",
  "If you could have any skill in the world without needing to practice, what skill would you choose?",
  "If you could instantly become an expert in any subject, which one would you choose?",
  "If you could be any animal for a day, which animal would you choose to be and why?",
  "If you could visit any country in the world, where would you go and what would you do there?",
  "If you could live in any city in the world, where would you choose to live and why?",
  "If you could have any type of weather all year round, what would you choose?",
  "If you could meet your future self, what question would you ask them?",
  "If you could be any age forever, what age would you choose and why?",
  "If you could have any fictional vehicle, which one would you choose and why?",
  "If you could make one book required reading for everyone, which one would it be and why?",
  "If you could see one famous person in concert (money is no object), who would it be and why?",
  "If a genie granted you one wish (no extra wishes), what would you wish for?",
  "If you had to choose a TV show to be in, which one would it be?",
  "Which actor/celebrity would you want to play you in a movie?",
  "If you could eliminate one household chore for the rest of your life, which would it be?",
  "Which way do you face when you shower? Back to the shower or facing the shower?",
  "What is one food you refuse to eat, and why?",
  "Do you wipe sitting or standing?",
  "When you wipe, do you crumple, roll, or fold the toilet paper?",
  "In what order do you put your clothing on?",
  "In what order do you wash your body in the shower?",
  "If you had to talk about 1 topic for an hour with no preparation, what would it be?",
  "What is the one show or movie that you haven't watched, but you feel like everyone else has?",
  "Where is the prettiest location you've ever travelled to?",
  "You're a burglar, but you can only steal things that mildly inconvenience your victims. What are you taking?",
  "If you could only eat one vegetable for the rest of your life, what would it be?",
  "If you could have any food, right now, what would it be?",
  "What is your favorite candy?",
  "Who would you pick to be on your Family Feud team? You get 5 people.",
  "If you had to choose one roommate from your family, who would it be and why?",
  "Who would you want to be for a day if it could be anyone?",
  "You have to sing one karaoke song, what is it?",
  "What is your preferred comfort food, and why?",
  "What is your favorite pizza, and why?",
  "What is your favorite attribute in a person?",
  "What message would you send to an alien civilization?",
  "Describe a typical Friday or Saturday night during your highschool years?",
  "If you could have any superpower, but could only use it once a month, what would it be?",
  "If there was a TV show based on your life, what would be the name of the show?",
  "What did you buy with your first work paycheck?",
  "If you were given $5,000 right now and you had to spend it in 1 hour, how would you spend it?",
  "If money was no object, what object would you collect?",
  "What is something you can't do, that most others can?",
  "If you could unlearn one piece of information, what would it be?",
  "If you could communicate with any animal species, which would you choose and why?",
  "If you could bring one extinct species back to life, which would you choose and why?"
]
