[
  "If you could design the perfect city of the future, what features would it have?",
  "If you could time travel to the future, how far ahead would you go?",
  "If you could have any futuristic technology today, what would it be?",
  "If you could choose one advancement in medical technology, what would it be?",
  "If you could have any cybernetic enhancement, what would it be?",
  "If you could upload your consciousness to a computer, would you?",
  "What is one thing you would bring back from the past that you can no longer find or buy?",
  "What if you could upload your consciousness into a digital world—would you do it?",
  "If you could download information directly into your brain, what would you learn first?",
  "Imagine a world where robots perform all the jobs—what would people do with their time?",
  "What if virtual reality became indistinguishable from real life—would you spend more time in it?",
  "If teleportation became a reality, how do you think it would change global culture and economy?",
  "Imagine a future where humans can merge with machines—how far would you go to enhance yourself?",
  "How do you think artificial intelligence will change the way we interact with technology in our homes by 2050?",
  "Could robots ever replace humans in creative fields like art and music?",
  "What new forms of communication might we develop in the next 20 years, beyond smartphones and social media?",
  "Do you think there will ever be a time when people choose to live entirely in virtual worlds? What might that look like?",
  "What role do you think nanotechnology will play in everyday life by 2040?",
  "What would the implications be for society if AI developed emotions/consciousness?",
  "Do you think we should avoid relying too heavily on AI in our society?",
  "If you could have one piece of futuristic tech in your home today, what would it be and why?",
  "Which sci-fi gadget do you think should absolutely become a reality in the next 50 years?",
  "If robots could do all your chores, what would you do with all your free time?",
  "Imagine your pet could have a tech upgrade—what would you choose for them?",
  "What’s the one thing in your daily routine you’d love to see automated?",
  "If you could have a conversation with an AI that knows everything about you, what’s the first thing you’d ask it?",
  "What futuristic kitchen gadget would make cooking a breeze for you?",
  "If you could have a personal AI assistant with a quirky personality, what traits would you give it?",
  "Imagine a world where technology could make you virtually immortal—what would you do with endless time?",
  "If you could name a newly discovered planet, what would you call it and why?",
  "If you could bring one thing from Earth to a new space colony, what would it be?",
  "If you could design your own spaceship, what cool features would it have?",
  "Imagine a world where you could change your appearance with the press of a button—what would you look like today?",
  "If you could choose to never feel pain again, would you take that option? Why or why not?",
  "What futuristic invention do you think could single-handedly save the planet?",
  "If you could eliminate one environmental problem with the snap of your fingers, which one would it be?",
  "If you could make one environmentally-friendly change to the world instantly, what would it be?",
  "Would you like a future in which everyone spoke the same language?",
  "If you could design your own virtual reality world, what would the theme be?",
  "If you could invent a new social norm that everyone had to follow, what would it be?",
  "If everyone had the same amount of money, how do you think people would try to stand out?",
  "If you could change one thing about the way we vote, what futuristic system would you put in place?",
  "If you could attend a concert in the future with any artist (living or dead), who would it be and where would it happen?",
  "If you could have a holographic version of any celebrity as your personal friend, who would you choose?",
  "If you could choose one old TV show to reboot with futuristic technology, which one would it be?",
  "If video games became fully immersive, what would be the first game world you’d want to live in?",
  "If you could control any appliance in your house with your mind, which would you choose?",
  "If you could have any super-sense (like super sight or hearing), which one would you choose?",
  "If scientists could make one food healthy and keep the taste exactly the same, what would you choose?",
  "How can we make sure that future AI develops in a way that is not harmful to humankind?",
  "In a futuristic world, what careers do you think will be least impacted by AI, and are therefore safe to pursue?"  
]
