[
  "If you could change one thing about yourself, what would it be?",
  "If you could relive any day in your life, which day would it be?",
  "If you could meet your teenage self, what advice would you give them?",
  "If you could only keep one memory from your life, which one would it be?",
  "If you could instantly change your career, what would you choose to do?",
  "What is your biggest regret?",
  "What is a recurring dream you have?",
  "What are your guilty pleasures?",
  "Have you ever met anyone famous? If so, who?",
  "What is your biggest fear?",
  "What's your most embarassing moment?",
  "What is something your oddly proud of, but don't regularly share with others?",
  "Do you have a hidden talent? If so, what is it?",
  "What's something you wish you would have done sooner?",
  "What is one thing you would like to change about yourself that is NOT physical, and why?",
  "What is the scariest thing that has ever happened to you?",
  "What is the best gift you've ever received?",
  "When you think about your grandparents, what food comes to mind?",
  "If you could ensure one achievement in your lifetime, what would it be?",
  "If you could be remembered for one thing after you die, what would you want it to be?",
  "What is your most vivid memory from the first decade of your life (can continue b to next decades if desired)?",
  "If you could have a conversation with your younger self, what advice would you give?",
  "If you could have a guaranteed successful career in any field, which would you choose and why?",
  "If you could remember every single detail of your life, would you want to? Why or why not?",
  "What was a moment in your life that completely changed your perspective on something important?",
  "What’s the most difficult decision you’ve ever had to make, and what did you learn from it?",
  "Can you share a time when you faced a significant challenge and how you overcame it?",
  "What’s a lesson you learned the hard way but are grateful for now?",
  "What’s a piece of advice you received that has stuck with you throughout your life?",
  "How has a failure or setback shaped the person you are today?",
  "What’s the most unexpected thing you’ve learned about yourself?",
  "Can you describe a moment when you felt truly proud of yourself?",
  "What’s something you wish you had known earlier in life?",
  "What is one of your earliest memories of our family?",
  "How do you think our family has shaped who you are today?",
  "Is there something you’ve always wanted to ask a family member but never did?",
  "What’s your favorite family tradition, and why is it meaningful to you?",
  "What do you think is the key to maintaining strong family bonds?",
  "What’s a memory with a family member that you’ll cherish forever?",
  "What’s something that has brought you a lot of joy recently?",
  "How do you express your emotions when you’re upset?",
  "Can you share a time when you felt really understood by someone?",
  "What’s a fear you have that you don’t often talk about?",
  "What’s a dream you’ve had since childhood that still inspires you today?",
  "If you could achieve one thing in the next five years, what would it be?",
  "What’s a passion project you’ve always wanted to start but haven’t yet?",
  "How do you envision your life 10 years from now?",
  "Who or what inspires you to chase your dreams?",
  "What’s a goal you’ve set for yourself that you’re proud of achieving?",
  "How do you stay motivated to pursue your aspirations?",
  "What’s something you’re currently working towards, and why is it important to you?",
  "How have your beliefs evolved over time?",
  "What’s something you believe deeply in, even if it’s not widely accepted?",
  "What’s your definition of true love?",
  "Can you share a memory of when you first fell in love?",
  "How has your view of love changed over the years?",
  "How do you express love in your relationships?",
  "What’s the most romantic thing someone has ever done for you?",
  "What do you think is the secret to a long-lasting relationship?",
  "How do you balance independence and closeness in a romantic relationship?",
  "What’s a decision you regret, and what would you do differently now?",
  "How do you approach asking for forgiveness when you’ve hurt someone?",
  "What’s a situation you wish you had handled differently?",
  "How do you cope with feelings of regret?",
  "Can you share a time when you forgave someone and how it changed your relationship?",
  "What’s something you’ve forgiven yourself for?",
  "How do you decide when it’s time to forgive and move on?",
  "How do you measure personal growth in your life?",
  "What’s something you’re currently working on to improve yourself?",
  "Can you share a time when self-reflection led to a significant change in your life?",
  "How do you stay committed to personal development?",
  "What’s a habit you’ve developed that has had a positive impact on your life?",
  "How do you handle setbacks in your journey of self-improvement?",
  "What’s a book, quote, or philosophy that has influenced your personal growth?",
  "What’s a part of yourself that you’re most proud of?",
  "How do you maintain a balance between accepting yourself and striving to improve?",
  "How do you want to be remembered by those who know you?",
  "What’s something you hope to pass on to future generations?",
  "What’s a legacy you’re actively working to create?",
  "Who has left a lasting impact on your life, and how?",
  "What do you believe is your greatest contribution to those around you?",
  "How do you hope to influence the lives of others?",
  "What’s a story from your life that you want people to remember?",
  "How do you define a meaningful life?",
  "What’s something you hope people will say about you when you’re gone?",
  "What do you believe is the purpose of life?",
  "How do you find meaning in the face of life’s challenges?",
  "What do you think happens after we die?",
  "What role does fate or destiny play in your life?",
  "Do you believe everything happens for a reason? Why or why not?",
  "How do you find balance between free will and the circumstances you were born into?",
  "What does it mean to live a fulfilling life?",
  "What’s a question about life you wish you had an answer to?",
  "What is the last thing you learned how to do, just because you wanted to learn how to do it?",
  "What piece of media shaped you most as a child?"
]
